In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
data=pd.read_csv('../dataset/collected_data.csv')
result=pd.read_csv('../dataset/final_result.csv')

## 주변환경 데이터

In [4]:
data.head()

    ID  food  cafe  tour  bank  num_of_sta     uni_dist
0  101    27    11     1     1         0.0  1727.445882
1  102   141    57     0     8         1.0  1312.952825
2  103   132    49     0     8         1.0  1276.796875
3  104   268    86     0    13         1.0   906.704926
4  105   343    94     0    14         2.0   938.661548

In [5]:
data.shape

(1527, 7)

## 인구 통계 데이터

- tot pop : 총인구
- saup : 사업체수
- jong : 종사자수
- 2049: 20~40세 인구
- single: 1인가구수
- y ratio : 20~49세 인구비율
- one_ratio : 1인가구 비율

In [9]:
result=result.drop(['tot_ga'], axis=1)

In [10]:
result.head()

,ID,tot_pop,saup,jong,2049,single,y_ratio,one_ratio
0,101,3119.308642,82.687420,905.496981,1783.264692,629.216224,0.571686,0.415103
1,102,5553.265017,585.298449,5327.718891,3191.545510,1399.156993,0.574715,0.485508
2,103,5347.571669,552.451941,4852.300334,3055.182027,1312.241227,0.571321,0.477412
3,104,3746.554975,1015.973100,7884.476026,2009.505848,776.205709,0.536361,0.429680
4,105,3603.847069,1029.199546,7764.478220,1876.293354,691.128573,0.520636,0.408744

In [11]:
result.shape

(1527, 8)

In [12]:
station_info=pd.merge(data, result, how='inner', on='ID')
station_info.head()

,ID,food,cafe,tour,bank,num_of_sta,uni_dist,tot_pop,saup,jong,2049,single,y_ratio,one_ratio
0,101,27,11,1,1,0.0,1727.445882,3119.308642,82.687420,905.496981,1783.264692,629.216224,0.571686,0.415103
1,102,141,57,0,8,1.0,1312.952825,5553.265017,585.298449,5327.718891,3191.545510,1399.156993,0.574715,0.485508
2,103,132,49,0,8,1.0,1276.796875,5347.571669,552.451941,4852.300334,3055.182027,1312.241227,0.571321,0.477412
3,104,268,86,0,13,1.0,906.704926,3746.554975,1015.973100,7884.476026,2009.505848,776.205709,0.536361,0.429680
4,105,343,94,0,14,2.0,938.661548,3603.847069,1029.199546,7764.478220,1876.293354,691.128573,0.520636,0.408744

In [13]:
station_info.shape

(1527, 14)